Tasks/ЗадачиАптечнымПунктам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Task>
		<Properties>
			<Name>ЗадачиАптечнымПунктам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АптечныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокОтделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НужноВыполнить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/ЗадачиАптечнымПунктам/Forms/ФормаЗадач/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ОбновитьСтатусЗадачи(МассивЗадач, НовыйСтатус)
	Для Каждого ТекЗадача Из МассивЗадач Цикл // Обойдем все элементы массива
		ЗадачаОбъекта=ТекЗадача.ПолучитьОбъект(); // Получаем объект по ссылке
		
		Если ЗадачаОбъекта.Статус=НовыйСтатус Тогда
		     Продолжить;
		 КонецЕсли;
		 
		 ЗадачаОбъекта.Статус=НовыйСтатус;
		 
		 Если НовыйСтатус = Перечисления.СтатусыЗадач.Готово Тогда
			  ЗадачаОбъекта.Выполнено=Истина
		 КонецЕсли;
		 
		 // Используем обработчик ошибок, чтобы оперативноя выявить проблему при записи
		 Попытка
			 ЗадачаОбъекта.Записать();
		     // Программная запись/проведение/отмена проведения документа осуществляется при помощи метода Записать
		 Исключение
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст="Не удалось изменить статус задачи "+ТекЗадача+" по причине: "+ОписаниеОшибки();
			 // Описание ошибки -  петод для получения ошибки
			 Сообщение.Сообщить();
		 КонецПопытки;
		 
	 КонецЦикла;
	 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыЗадачКлиент(МассивЗначений,НовыйСтатус)
	
	Если ТипЗнч(МассивЗначений)=Тип("Массив")Тогда
		ОбновитьСтатусЗадачи(МассивЗначений, НовыйСтатус);
	КонецЕсли;

	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиАптечнымПунктам"));
КонецПроцедуры


&НаКлиенте
Процедура СписокНужноВыполнитьПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.НужноВыполнить"));
КонецПроцедуры

&НаКлиенте
Процедура ВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.ВРаботе"));
КонецПроцедуры

&НаКлиенте
Процедура ГотовоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Готово"));
КонецПроцедуры


// Излишнее повторение. Лучше организовать через процедуру!

//&НаКлиенте
//Процедура ГотовоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
//	   МассивЗначений=ПараметрыПеретаскивания.Значение;
//	Если ТипЗнч(МассивЗначений)=Тип("Массив")Тогда
//		ОбновитьСтатусЗадачи(МассивЗначений, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Готово"));
//	КонецЕсли;
//	
//КонецПроцедуры
